<?php

/**
 *
 * Описание файла: Хранилище массивов
 *
 */

if (!defined('BASEPATH')) exit('No direct script access allowed');


class lib_arrays {
  function for_days(){
    $for_days['9'] = 'Не выбран';
    $for_days['0'] = 'длительный срок (от года)';
    $for_days['1'] = 'посуточно (до месяца)';
    $for_days['2'] = 'несколько месяцев (меньше года)';
    return $for_days;
  } 
  
  function voiter($type='activ'){
    if($type=='activ')return TRUE;
    return 'voit_city_mgr';
  }
  
  function admin_phones(){
    return array();
  }
  
  function proger_phones(){
    return array('79067697146','79688476905');
  }
  
  function admin_and_proger_phones(){
    return array('79067697146','79688476905');
  }
  
  function rus(){
     return array("ё","й","ю","ь","ч","щ","ц","у","к","е","н","г","ш","з","х","ъ","ф","в","а","п","р","о","л","д","ж","э","я","с","м","и","т","б","Ё","Й","Ю","Ч","Ь","Щ","Ц","У","К","Е","Н","Г","Ш","З","Х","Ъ","Ф","В","А","П","Р","О","Л","Д","Ж","Э","Я","С","М","И","Т","Б"," ","ы","Ы");
       }
  function eng(){
     return array("yo","iy","yu","'","ch","sh","c","u","k","e","n","g","sh","z","h","'","f","v","a","p","r","o","l","d","j","Yе","ya","s","m","i","t","b","Yo","Iy","Yu","CH","'","SH","C","U","K","E","N","G","SH","Z","H","'","F","V","A","P","R","O","L","D","J","YE","YA","S","M","I","T","B","_","yy","YY");
      }
  
  function smile_array(){
    $smile_array[':)'] = 'Smile.png';
    $smile_array['!ААААА!'] = 'Ahhhh.png';
    $smile_array['!пришелец!'] = 'Alien.png';
    $smile_array['!ухмылка!'] = 'Bad.png';
    $smile_array['!краснею!'] = 'Blush.png';
    $smile_array['!профи!'] = 'Cool.png';
    $smile_array['!\'('] = 'Crying.png';
    $smile_array['!чёртик!'] = 'Devil.png';
    $smile_array['xO'] = 'Doh.png';
    $smile_array['!рад!'] = 'Happy.png';
    $smile_array[':|'] = 'Huh.png';
    $smile_array[':D'] = 'Laugh.png';
    $smile_array['!любовь!'] = 'Love.png';
    $smile_array['!злой!'] = 'Mad.png';
    $smile_array['!нинзя!'] = 'Ninja.png';
    $smile_array[':O'] = 'Ohhhh.png';
    $smile_array[':('] = 'Sad.png';
    $smile_array['!напуган!'] = 'Scary.png';
    $smile_array['!напуганая улыбка!'] = 'Scary-Smile.png';
    $smile_array['!шок!'] = 'Shocking.png';
    $smile_array['!болен!'] = 'Sick.png';
    $smile_array['!сплю!'] = 'Sleep.png';
    $smile_array['!расстроен!'] = 'Tear.png';
    $smile_array[':P'] = 'Tounge.png';
    $smile_array['!что?!'] = 'What.png';
    $smile_array[';)'] = 'Wink.png';
    $smile_array['=)'] = 'Woot.png';
    $smile_array['!жуткая улыбка!'] = 'anima/1.gif';
    $smile_array['!гадость!'] = 'anima/2.gif';
    $smile_array['!подозрительно!'] = 'anima/3.gif';
    $smile_array['!чёртик 2!'] = 'anima/4.gif';
    $smile_array['!злюка!'] = 'anima/5.gif';
    $smile_array['!но-но-но!'] = 'anima/6.gif';
    $smile_array['!насвистываю!'] = 'anima/7.gif';
    $smile_array['!ангелок!'] = 'anima/8.gif';
    $smile_array['!панк!'] = 'anima/9.gif';
    $smile_array['!работаю!'] = 'anima/10.gif';
    $smile_array['!дракончик!'] = 'anima/11.gif';
    $smile_array['!рыцарь!'] = 'anima/12.gif';
    $smile_array['!фея!'] = 'anima/13.gif';
    $smile_array['!ребёнок!'] = 'anima/14.gif';
    $smile_array['!класс!'] = 'anima/19.gif';
    $smile_array['!смех!'] = 'anima/20.gif';
    $smile_array['!где я? кто я?!'] = 'anima/21.gif';
    $smile_array['!цветочки!'] = 'anima/22.gif';
    $smile_array['!милашка!'] = 'anima/15.gif';
    $smile_array['!подмигиваю!'] = 'anima/16.gif';
    $smile_array['!какая перелесть!'] = 'anima/17.gif';
    $smile_array['!злючка!'] = 'anima/18.gif';
    $smile_array['!целую!'] = 'anima/23.gif';

    return $smile_array;
  }
  
  function smiles(){
    $smile_array = $this->smile_array();
    foreach ($smile_array as $key=> $val){
    $max_height='35';
    if($val=='anima/5.gif' or $val=='anima/6.gif'  or $val=='anima/3.gif'  or $val=='anima/7.gif' or  $val=='anima/23.gif') $max_height='30';
    $smiles['img'][] = '<img title="'.str_replace("!","",$key).'" src="'.base_url().'img/smiles/'.$val.'" style="margin-bottom: -6px; max-height: '.$max_height.'px;"/>';
    $smiles['smile'][] = $key;
    $smiles[$key] = '<img title="'.str_replace("!","",$key).'" src="'.base_url().'img/smiles/'.$val.'" style="margin-bottom: -6px; max-height: '.$max_height.'px;"/>'; 
    }
    return $smiles;
  }
  
  function buh_type(){
    $buh_type[1]='Прибыло';
    $buh_type[2]='Убыло';
    $buh_type[3]='Ячейка';
    $buh_type[4]='Ожидаемая сумма';
    $buh_type[5]='Резерв';
    return $buh_type;
  }
  
  function buh_type_color(){
    $buh_type_color[1]='#008c0a';
    $buh_type_color[2]='#ff0000';
    $buh_type_color[3]='#0dea1d';
    $buh_type_color[4]='#7ed384';
    $buh_type_color[5]='#ed4b75';
    return $buh_type_color;
  }
  
    function cash_type(){
    $cash_type[1]='Наличные';
    $cash_type[2]='Електронные деньги';
    $cash_type[3]='Без наличный расчёт';
    return $cash_type;
  }
  
   function calculation_type(){
    $calculation_type[1] = 'Агентский';
    $calculation_type[2] = 'Менеджерский';
    return $calculation_type;
   }
  
  
  function video2(){
     $array[1] = 'Подготовка к успешным продажам МБШ 1 диск';
     $array[2] = '1. Сервис Джон Шоул';
     $array[3] = 'Круц Сергей Техника активных продаж для риэлторов 1';
     $array[4] = 'Подготовка к успешным продажам МБШ 2 диск';
     $array[5] = 'Круц Сергей Техника активных продаж для риэлторов 2';
     $array[6] = 'Круц Сергей Техника активных продаж для риэлторов 3';
     $array[7] = 'Круц Сергей Техника активных продаж для риэлторов 4';
     $array[8] = 'Круц Сергей Техника активных продаж для риэлторов 5';
     $array[9] = 'Круц Сергей Техника активных продаж для риэлторов 6';
     $array[10] = 'Круц Сергей Техника активных продаж для риэлторов 7';
     $array[11] = 'Круц Сергей Техника активных продаж для риэлторов 8';
     $array[12] = 'norka1';
     $array[13] = 'norka2';
     $array[14] = 'norka3';
     $array[15] = 'norka4';
     $array[16] = 'norka5';
     $array[17] = 'norka6';
     $array[18] = 'norka7';
     $array[19] = 'norka8';
     $array[20] = 'Джон Шоул диск 2 часть 1';
     $array[21] = 'Джон Шоул диск 2 часть 2';
     $array[22] = 'Джон Шоул диск 2 часть 3';
     return $array;
  }
  
  
  
  function video3(){
     $array[23] = 'Бизнес-интуиция 1 #3';
     $array[24] = 'Бизнес-интуиция 1 #4';
     $array[25] = 'Бизнес-интуиция 1 #5';
     $array[26] = 'Бизнес-интуиция 1 #6';
     $array[27] = 'Бизнес-интуиция 2 #2';
     $array[28] = 'Бизнес-интуиция 2 #3';
     $array[29] = 'Бизнес-интуиция 2 #4';
     $array[30] = 'Вам предъявили претензию';
     $array[31] = 'Ваш_успех_в_перегов?орах';
     $array[32] = 'Гороскоп не обманул';
     $array[33] = 'Легко ли быть менеджером_1';
     $array[34] = 'Легко ли быть менеджером_2';
     $array[35] = 'Первокласный сервис как конкурентное преимущество';
     $array[36] = 'По_рукам ответы на возражения';
     $array[37] = 'ПОДГОТОВКА К ПЕРЕГОВОРАМ';
     $array[38] = 'Продажи Школа Тигра';
     $array[39] = 'Радмило Лукич эф. продажи 1-1';
     $array[40] = 'Радмило Лукич эф. продажи 1-2';
     $array[41] = 'Радмило Лукич эф. продажи 2-1';
     $array[42] = 'Радмило Лукич эф. продажи 2-2';
     $array[43] = 'Радмило Лукич эф. продажи 3-1';
     $array[44] = 'Радмило Лукич эф. продажи 3-2';
     $array[45] = 'Радмило Лукич эф. продажи 4-1';
     $array[46] = 'Радмило Лукич эф. продажи 4-2';
     $array[47] = 'Спасибо за звонок_ как привлекать клиентов по телефону';
     $array[48] = 'Ступени продаж часть1';
     $array[49] = 'Ступени продаж часть2';
     $array[50] = 'Супервизия для риэлторов';
     $array[51] = 'Холодные звонки или поиск клиента по телефону';
     return $array;
  }
  
  
  function shifr(){
    $shifr['0'] = '6546';
    $shifr['1'] = '1265';
    $shifr['2'] = '645';
    $shifr['3'] = '11325';
    $shifr['4'] = '4112';
    $shifr['5'] = '12987';
    $shifr['6'] = '1451';
    $shifr['7'] = '458';
    $shifr['8'] = '657';
    $shifr['9'] = '988';
    return $shifr;
  } 
  
  private $manager_data = FALSE;
  private function fetch_manager_data(){
    if($this->manager_data!==FALSE){
        return $this->manager_data;
    }
    $CI = &get_instance();
    $CI->db->select('id, otdel_id, soname, name');
    $CI->db->where_in('job', array(2,27));
    $CI->db->where('block', 0);
    $CI->db->where('fire', 0);
    $CI->db->group_by('otdel_id');
    $query = $CI->db->get('users');
    $res = $query->result_array();
    $this->manager_data = array();
    foreach($res as $row){
        $name = $row['soname'].' '.substr($row['name'],0,1).'.';
        $this->manager_data[$row['otdel_id']] = array($row['id'], $name);
    }
    return $this->manager_data;
  }
  
  function managers(){
    /*
    $managers['0'] = 'Ожидает распеределения роботом';
    $managers['1'] = 'Газарян А.';
    $managers['2'] = 'Валиев А.';
    $managers['4'] = 'Матросов А.';
    $managers['5'] = 'Першиков С.';
    $managers['6'] = 'Дячек Д.';
    $managers['10'] = 'Коновалов Р.';
    $managers['11'] = 'Кравченко С.';
    $managers['18'] = 'Канахин Н.';
    $managers['23'] = 'Коновалов А.';
    $managers['24'] = 'Не уточнён';
    $managers['29'] = 'Приколотин А.';
    */
    $manager_data = $this->fetch_manager_data();
    $managers = array();
    foreach($manager_data as $otdel_id=>$data){
        $managers[$otdel_id] = $data[1];
    }
    return $managers;
  }  

  function managers_id(){
    /*
    $managers['0'] = '2';
    $managers['1'] = '25';
    $managers['2'] = '89';
    $managers['4'] = '18';
    $managers['5'] = '11';
    $managers['6'] = '88';
    $managers['10'] = '10';
    $managers['11'] = '11177';
    $managers['18'] = '11639';
    $managers['23'] = '134';
    $managers['24'] = '0';
    $managers['29'] = '11262';
    */
   // $managers['temp'] = '23'; // временно коновалова
    $manager_data = $this->fetch_manager_data();
    $managers = array();
    foreach($manager_data as $otdel_id=>$data){
        $managers[$otdel_id] = $data[0];
    }
    return $managers;
  }

  function status(){
    $s_status['1'] = 'Новое';
    $s_status['0'] = 'В работе';
    $s_status['2'] = 'В рекламе';
    $s_status['5'] = 'Аванс';
    $s_status['9'] = 'Общедоступен';
    $CI= &get_instance();
  if($CI->session->userdata('dep')==2)  $s_status['10'] = 'Аванс(псевдо)';
  //  $s_status['3'] = 'К менеджеру';
  //  $s_status['6'] = 'К агенту';
    return $s_status;
  }
  
  function status_c(){
   $status_c =  $this->status();
   unset($status_c['9']);
   $status_c['2'] = 'Активный поиск';
   return $status_c;
  }
      
  function rooms(){
     $s_roomp[0]="Комната"; 
     $s_roomp[1]="1 комнатная"; 
     $s_roomp[2]="2 комнатная";
     $s_roomp[3]="3 комнатная";
     $s_roomp[4]="4 комнатная";
     $s_roomp[5]="5 комнатная";
     $s_roomp[6]="6+ комнатная";
     $s_roomp[7]="Не выбрано";
     return $s_roomp;
  }  
  
  function rooms_old(){
     $s_roomp[0]="Комната"; 
     $s_roomp[1]="1"; 
     $s_roomp[2]="2";
     $s_roomp[3]="3";
     $s_roomp[4]="4";
     $s_roomp[5]="5";
     return $s_roomp;
  }  
  
  function house_seria(){
    $seria[]="Не выбран";
    $seria[]="И-155";
    $seria[]="Индивид. Проект";
    $seria[]="КОПЭ";
    $seria[]="КОПЭ-М-Парус";
    $seria[]="П-3М";
    $seria[]="С-222";
    $seria[]="П-46М";
    $seria[]="ГМС-1";
    $seria[]="П-44Т";
    $seria[]="П-44ТМ";
    $seria[]="П-44К";
    $seria[]="ГМС-3";
    $seria[]="И-1723";
    $seria[]="ИП-46С";
    $seria[]="ГМС-2001";
    $seria[]="П-111";
    $seria[]="П-55М";
    $seria[]="П-30";
    $seria[]="ТМ-25";
    $seria[]="ЮБИЛЕЙНЫЙ";
    $seria[]="ПД-4";
    $seria[]="И-1724";
    $seria[]="П-55";
    $seria[]="РД-90";
    $seria[]="II-49";
    $seria[]="II-68";
    $seria[]="1-515/1";
    $seria[]="II-18";
    $seria[]="П-111М";
    $seria[]="П-111МО";
    $seria[]="С-111М";
    $seria[]="П-46";
    $seria[]="П-44М";
    $seria[]="П-44";
    $seria[]="П-3";
    $seria[]="И-1279";
    $seria[]="БЕКЕРОН";
    $seria[]="ПРИЗМА";
    $seria[]="КОЛОС";
    return $seria;

  }
  
  
  function color(){
    $lines = $this->metro_lines();
   $color[]= array_merge(Array('m1'),$lines[0]);
   $color[]= array_merge(Array('m2'),$lines[1]);
   $color[]= array_merge(Array('m3'),$lines[2]);
   $color[]= array_merge(Array('m4'),$lines[3]);
   $color[]= array_merge(Array('m5'),$lines[4]);
   $color[]= array_merge(Array('m6'),$lines[5]);
   $color[]= array_merge(Array('m7'),$lines[6]);
   $color[]= array_merge(Array('m8'),$lines[7]);
   $color[]= array_merge(Array('m9'),$lines[8]);
   $color[]= array_merge(Array('m10'),$lines[9]);
   $color[]= array_merge(Array('m12'),$lines[10]);
   return $color;
  }
  
    function metro_lines(){
        $lines[0]= Array(40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29, 28, 27, 26, 157, 25, 24, 23, 1189, 1190, 1191, 1192, 1193, 1194, 1195);
        $lines[1]= Array(1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 18, 15, 19, 20, 21, 22, 1197);
        $lines[2]= Array(62, 61, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 202, 200, 203, 196, 165, 201, 60, 214);
        $lines[3]= Array(60, 59, 58, 57, 56, 55, 54, 52, 1161, 1158, 53, 198, 197);
        $lines[4]= Array(89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 88, 74, 103, 102, 136, 104, 105, 106, 107, 108, 109, 110);
        $lines[5]= Array(63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 215, 216);
        $lines[6]= Array(210, 82, 83, 84, 85, 86, 87, 88);
        $lines[7]= Array(195, 194, 193, 192, 212, 164, 156, 155, 130, 129, 128, 127, 126, 125, 124, 123, 122, 121, 120, 119, 118, 117, 116, 115, 114, 113, 112, 111, 131, 135);
        $lines[8]= Array(204, 205, 199, 206, 137, 138, 139, 140, 144, 141, 142, 143, 145, 146, 205, 207, 208, 209, 205);
        $lines[9]= Array(17, 16, 15);
        $lines[10]= Array(48, 35, 136, 134, 7, 133, 52, 28, 100, 132, 12, 75);
        return $lines;
    }
    
    function metro_line_names(){
        $line_names[0] = 'Сокольническая';
        $line_names[1] = 'Замоскворецкая';
        $line_names[2] = 'Арбатско-Покровская';
        $line_names[3] = 'Филевская';
        $line_names[4] = 'Калужско-Рижская';
        $line_names[5] = 'Таганско-Краснопресненская';
        $line_names[6] = 'Калининская';
        $line_names[7] = 'Бутовская';
        $line_names[8] = 'Люблинско-Дмитровская';
        $line_names[9] = 'Каховская';
        $line_names[10] = 'Кольцевая';
        return $line_names;
    }
    
    function delete_as($type='object'){
        if($type=='object'){
        $delete_as = array(
        //аренда
		'1' => 'Сдали',
		'2' => 'не устраивает район',
		'3' => 'Не устраивает цена',
		'4' => 'состав соискателя не соответствует',
		'5' => 'не рассматривают клиентов с детьми',
		'6' => 'не рассматривают клиентов с животными',
		'7' => 'рассматривают другую национальность',
		'8' => 'клиенты ищут пустую квартиру',
		'9' => 'клиенты ищут квартиру с мебелью',
		'10' => 'не устраивает срок аренды',
		'11' => 'не подходит район',
		'12' => 'не устраивает этаж',
		'13' => 'не устраивает метраж',
		'14' => 'нет балкона',
		'15' => 'санузел нераздельный',
		'16' => 'ищут с раздельными комнатами',
		'17' => 'не устраивает ремонт',
        //продажа
        '30'	=> 'место положение',
		'31'	=> 'Доступность от метро',
		'32'	=> 'Этаж / Этажность',
		'33'	=> 'Тип дома',
		'34'	=> 'Количеств комнат',
		'35'	=> 'Площадь общая',
		'36'	=> 'Площадь кухни',
		'37'	=> 'Цена',
		'38'	=> 'отсутствие лифта',
		'39'	=> 'Сумма в ДКП (новый пункт)',
		'40'	=> 'Основание собственности',
		'41'	=> ' Тип Продажи',
		'42'	=> 'ИПОТЕКА',
		'43'	=> 'нет балкона/ лоджии',
		'44'	=> 'Вид из окна',
		'45'	=> 'Тип сан/узла',
		'46'	=> 'НОВОСТРОЙКА',
		'47'	=> 'ПЕРЕПЛАНИРОВКА',
		'48'	=> 'Тип ремонта',
		'49'	=> 'Отложил (календарик)',
        '51'	=> 'Продано'
        );
        }else{
        $delete_as = array(
        //аренда
		'1' => 'Сняли',
		'2' => 'не устраивает район',
		'3' => 'Не устраивает цена',
		'4' => 'состав соискателя не соответствует',
		'5' => 'не рассматривают клиентов с детьми',
		'6' => 'не рассматривают клиентов с животными',
		'7' => 'рассматривают другую национальность',
		'8' => 'клиенты ищут пустую квартиру',
		'9' => 'клиенты ищут квартиру с мебелью',
		'10' => 'не устраивает срок аренды',
		'11' => 'не подходит район',
		'12' => 'не устраивает этаж',
		'13' => 'не устраивает метраж',
		'14' => 'нет балкона',
		'15' => 'санузел нераздельный',
		'16' => 'ищут с раздельными комнатами',
		'17' => 'не устраивает ремонт',
        
        //продажа
        '30'	=> 'место положение',
		'31'	=> 'Доступность от метро',
		'32'	=> 'Этаж / Этажность',
		'33'	=> 'Тип дома',
		'34'	=> 'Количеств комнат',
		'35'	=> 'Площадь общая',
		'36'	=> 'Площадь кухни',
		'37'	=> 'Цена',
		'38'	=> 'отсутствие лифта',
		'39'	=> 'Сумма в ДКП (новый пункт)',
		'40'	=> 'Основание собственности',
		'41'	=> ' Тип Продажи',
		'42'	=> 'ИПОТЕКА',
		'43'	=> 'нет балкона/ лоджии',
		'44'	=> 'Вид из окна',
		'45'	=> 'Тип сан/узла',
		'46'	=> 'НОВОСТРОЙКА',
		'47'	=> 'ПЕРЕПЛАНИРОВКА',
		'48'	=> 'Тип ремонта',
		'49'	=> 'Отложил (календарик)',
        '50'	=> 'Купил/ нечего не ищет',
        
        );
        }
        return $delete_as;
    }
    
    function block_risons(){
      return  array('Не выбрано',
        'Неудовлетворенность методами управления непосредственного руководителя ',
        'Неудовлетворенность выполняемой работой (неинтересная, нет быстрого результата и т.д.)',
        'Семейные обстоятельства (переезд в другой город, перевод мужа и т.д.)',
        'По состоянию здоровья (невозможность работы разъездного характера и т.д.)',
        'Отдаленность работы от места жительства.',
        'Мошенничество (левые сделки, распространение инфо)',
        'Обман.',
        'Не выход на работу сотрудника более 2 суток без уважительной причины.',
        'Нарушение дисциплины внутри компании (внутренний трудовой распорядок,  хамство и т.д.)',
        'Невозможность совмещения работы с учебой',
        'Неудовлетворенность режимом работы, графиком работы.',
        'Неудовлетворенность размером заработной платы.',
        'Неудовлетворенность методами управления Администрации Компании',
        'Неблагоприятная обстановка в коллективе',
        'Неудовлетворенность работой из-за отсутствия карьерного роста и/или невозможность повышения своей квалификации',
        'Неудовлетворенность способами и методами контроля и сохранности имущества компании.',
        'Другая');
    }
  
  
  function metro_winner(){
    $metro = $this->metro();
    $metro[155] = 'Улица Академика Янгеля';
    $metro[24] = 'Проспект Вернадского';
    $metro[28] = 'Парк культуры';
    $metro[95] = 'Новые Черемушки';
    $metro[157] = 'Воробьевы Горы';
    $metro[164] = 'Бульвар Дмитрия Донского';
    $metro[53] = 'Александровский Сад';
    $metro[31] = 'Охотный ряд';
    $metro[204] = 'Марьина Роща';
    $metro[192] = 'Улица Скобелевская';
    $metro[0] = 'Мякинино';
    $metro[30] = 'Библиотека им.Ленина';
    $metro[74] = 'Китай-Город';
    $metro[193] = 'Бульвар Адмирала Ушакова';
    $metro[84] = 'Шоссе Энтузиастов';
    $metro[139] = 'Крестьянская Застава';
    $metro[49] = 'Площадь Революции';
    

    return $metro;
  }  
    

  function metro(){
    $s_metro[214]=	'Пятницкое шоссе';
    $s_metro[1158]=	'Арбатская (ф)';
    $s_metro[215]=	'Лермонтовский проспект';
 	$s_metro[216]=	'Жулебино';
 	$s_metro[1191]=	'Востряково';
 	$s_metro[1189]=	'Никулинская';
 	$s_metro[209]=	'Зябликово';
 	$s_metro[210]=	'Новокосино';
 	$s_metro[207]=	'Борисово';
 	$s_metro[1194]=	'Боровское шоссе';
 	$s_metro[1197]=	'Алма-Атинская';
 	$s_metro[1190]=	'Олимпийская деревня';
 	$s_metro[1195]=	'Новопеределкино';
 //	$s_metro[1187]=	'Выставочный центр'; 
 	$s_metro[212]=	'Улица Старокачаловская';
 	$s_metro[1192]=	'Терешково';
 //$s_metro[1185]=	'Телецентр';
 	$s_metro[1161]=	'Смоленская (ф)';
 //	$s_metro[211]=	'Улица Сергея Эйзенштейна';
 	$s_metro[1193]=	'Солнцево';
 //	$s_metro[1183]=	'Тимиирязевская (лм)';
 	$s_metro[208]=	'Шипиловская';
 //	$s_metro[1196]=	'Юго-Западная (лм)';
 //	$s_metro[1186]=	'Улица Академика Королева';
 	$s_metro[206]=	'Сретенский бульвар';
 //	$s_metro[1184]=	'Улица Милашенкова';
     $s_metro[0]="не выбрано";
     $s_metro[85]="Авиамоторная";
     $s_metro[13]="Автозаводская";
     $s_metro[97]="Академическая";
     $s_metro[53]="Александровский сад";
     $s_metro[105]="Алексеевская";
     $s_metro[135]="Алтуфьево";
     $s_metro[156]="Аннино";
     $s_metro[50]="Арбатская";
     $s_metro[5]="Аэропорт";
     $s_metro[109]="Бабушкинская";
     $s_metro[57]="Багратионовская";
     $s_metro[71]="Баррикадная";
     $s_metro[47]="Бауманская";
     $s_metro[69]="Беговая";
     $s_metro[7]="Белорусская";
     $s_metro[93]="Беляево";
     $s_metro[131]="Бибирево";
     $s_metro[30]="Библиотека имени Ленина";
     $s_metro[120]="Боровицкая";
     $s_metro[107]="Ботанический сад";
     $s_metro[145]="Братиславская";
     $s_metro[195]="Бунинская аллея";
     $s_metro[106]="ВДНХ";
     $s_metro[16]="Варшавская";
     $s_metro[24]="Вернадского проспект";
     $s_metro[112]="Владыкино";
     $s_metro[2]="Водный стадион";
     $s_metro[3]="Войковская";
     $s_metro[77]="Волгоградский проспект";
     $s_metro[142]="Волжская";
     $s_metro[203]="Волоколамская";
     $s_metro[157]="Воробьевы горы";
     $s_metro[198]="Выставочная";
     $s_metro[81]="Выхино";
     $s_metro[6]="Динамо";
     $s_metro[115]="Дмитровская";
     $s_metro[132]="Добрынинская";
     $s_metro[21]="Домодедовская";
     $s_metro[164]="Донского Дмитрия бульвар";
     $s_metro[205]="Достоевская";
     $s_metro[140]="Дубровка";
     $s_metro[43]="Измайловская";
     $s_metro[94]="Калужская";
     $s_metro[18]="Кантемировская";
     $s_metro[17]="Каховская";
     $s_metro[15]="Каширская";
     $s_metro[52]="Киевская";
     $s_metro[74]="Китай-город";
     $s_metro[144]="Кожуховская";
     $s_metro[14]="Коломенская";
     $s_metro[35]="Комсомольская";
     $s_metro[92]="Коньково";
     $s_metro[22]="Красногвардейская";
     $s_metro[133]="Краснопресненская";
     $s_metro[36]="Красносельская";
     $s_metro[34]="Красные ворота";
     $s_metro[139]="Крестьянская застава";
     $s_metro[29]="Кропоткинская";
     $s_metro[62]="Крылатское";
     $s_metro[73]="Кузнецкий мост";
     $s_metro[79]="Кузьминки";
     $s_metro[60]="Кунцевская";
     $s_metro[48]="Курская"; 
     $s_metro[55]="Кутузовская";
     $s_metro[98]="Ленинский проспект";
     $s_metro[32]="Лубянка";
     $s_metro[143]="Люблино";
     $s_metro[87]="Марксистская";
     $s_metro[204]="Марьина роща";
     $s_metro[146]="Марьино";
     $s_metro[8]="Маяковская";
     $s_metro[110]="Медведково";
     $s_metro[197]="Международная";
     $s_metro[117]="Менделеевская";
     $s_metro[196]="Митино";
     $s_metro[61]="Молодежная"; 
     $s_metro[202]="Мякининская";
     $s_metro[124]="Нагатинская";
     $s_metro[125]="Нагорная";
     $s_metro[126]="Нахимовский проспект";
     $s_metro[82]="Новогиреево";
     $s_metro[11]="Новокузнецкая";
     $s_metro[134]="Новослободская";
     $s_metro[89]="Новоясеневская";
     $s_metro[95]="Новые черемушки";
     $s_metro[100]="Октябрьская";
     $s_metro[67]="Октябрьское поле";
     $s_metro[20]="Орехово";
     $s_metro[111]="Отрадное";
     $s_metro[31]="Охотный Ряд";
     $s_metro[12]="Павелецкая";
     $s_metro[28]="Парк Культуры";
     $s_metro[165]="Парк Победы";
     $s_metro[44]="Партизанская";
     $s_metro[42]="Первомайская";
     $s_metro[83]="Перово";
     $s_metro[113]="Петровско-Разумовская";
     $s_metro[141]="Печатники";
     $s_metro[59]="Пионерская";
     $s_metro[63]="Планерная";
     $s_metro[86]="Площадь Ильича";
     $s_metro[49]="Площадь революции";
     $s_metro[68]="Полежаевская";
     $s_metro[121]="Полянка";
     $s_metro[130]="Пражская";
     $s_metro[38]="Преображенская площадь";
     $s_metro[76]="Пролетарская";
     $s_metro[136]="Проспект Мира";
     $s_metro[96]="Профсоюзная";
     $s_metro[72]="Пушкинская";
     $s_metro[1]="Речной вокзал";
     $s_metro[104]="Рижская";
     $s_metro[138]="Римская";
     $s_metro[80]="Рязанский проспект";
     $s_metro[116]="Савеловская";
     $s_metro[108]="Свиблово";
     $s_metro[127]="Севастопольская";
     $s_metro[45]="Семеновская";
     $s_metro[122]="Серпуховская";
     $s_metro[192]="Скобелевская улица";
     $s_metro[201]="Славянский бульвар";
     $s_metro[51]="Смоленская";
     $s_metro[4]="Сокол";
     $s_metro[37]="Сокольники";
     $s_metro[26]="Спортивная";
     $s_metro[200]="Строгино";
     $s_metro[54]="Студенческая";
     $s_metro[102]="Сухаревская";
     $s_metro[64]="Сходненская";
     $s_metro[75]="Таганская";
     $s_metro[9]="Тверская";
     $s_metro[10]="Театральная";
     $s_metro[78]="Текстильщики";
     $s_metro[91]="Теплый стан";
     $s_metro[114]="Тимирязевская";
     $s_metro[88]="Третьяковская";
     $s_metro[199]="Трубная";
     $s_metro[123]="Тульская";
     $s_metro[103]="Тургеневская";
     $s_metro[65]="Тушинская";
     $s_metro[70]="Улица 1905 года";
     $s_metro[194]="Улица Горчакова";
     $s_metro[40]="Улица Подбельского";
     $s_metro[25]="Университет";
     $s_metro[193]="Ушакова адмирала бульвар";
     $s_metro[58]="Филевский парк";
     $s_metro[56]="Фили";
     $s_metro[27]="Фрунзенская";
     $s_metro[19]="Царицыно";
     $s_metro[118]="Цветной бульвар";
     $s_metro[39]="Черкизовская";
     $s_metro[128]="Чертановская";
     $s_metro[119]="Чеховская";
     $s_metro[33]="Чистые пруды";
     $s_metro[137]="Чкаловская";
     $s_metro[99]="Шаболовская";
     $s_metro[84]="Шоссе энтузиастов";
     $s_metro[41]="Щелковская";
     $s_metro[66]="Щукинская";
     $s_metro[46]="Электрозаводская";
     $s_metro[23]="Юго-Западная";
     $s_metro[129]="Южная";
     $s_metro[155]="Янгеля Академика";
     $s_metro[90]="Ясенево";
     return $s_metro;
  }
  
  function end_metro(){
    $s_metro[1]="Речной вокзал";
    $s_metro[135]="Алтуфьево";
    $s_metro[110]="Медведково";
    $s_metro[40]="Улица Подбельского";
    $s_metro[41]="Щелковская";
    $s_metro[82]="Новогиреево";
    $s_metro[81]="Выхино";
    $s_metro[146]="Марьино";
    $s_metro[22]="Красногвардейская";
    $s_metro[164]="Донского Дмитрия бульвар";
    $s_metro[89]="Новоясеневская";
    $s_metro[23]="Юго-Западная";
    //$s_metro[214]='Пятницкое шоссе';
    $s_metro[196]="Митино";//пятницкое вместо митино
    $s_metro[63]="Планерная";
    return $s_metro;
  }
 
  function geo_metro(){
    $geocode[1195]=	'37.353878%2C55.639269';
    $geocode[214]=	'37.354025%2C55.855644';
    $geocode[1197]=	'37.765678%2C55.63349';
    $geocode[213]=	'37.765678%2C55.63349';
    $geocode[1193]='37.401637%2C55.654029';
    $geocode[1]='37.476188%2C55.854855';
        $geocode[1]='37.476188%2C55.854855';
        $geocode[111]='37.604843%2C55.863384';
        $geocode[50]='37.604116%2C55.752516';
        $geocode[1158]='37.601618%2C55.752121';
        $geocode[215]='37.852275%2C55.701765';
        $geocode[216]='37.855123%2C55.684539';
        $geocode[1191]='37.814744%2C55.382462';
        $geocode[210]='37.863945%2C55.745217';
        $geocode[209]='37.751718%2C55.621089';
        $geocode[208]='37.743702%2C55.620964';
        $geocode[1187]='37.638494%2C55.824086';
        $geocode[212]='37.576708%2C55.568838';
        $geocode[1185]='37.608975%2C55.821795';
        $geocode[1161]='37.583841%2C55.74764';
        $geocode[]='37.581658%2C55.749060';
        $geocode[211]='37.644998%2C55.829305';
        $geocode[]='37.575387%2C55.818882';
        $geocode[1183]='37.578612%2C55.818948';
        $geocode[1196]='37.482852%2C55.663146';
        $geocode[1186]='37.627166%2C55.821821';
        $geocode[206]='37.635817%2C55.765949';
        $geocode[1184]='37.591207%2C55.821876';
        $geocode[85]='37.716621%2C55.751432';
        $geocode[13]='37.657008%2C55.706634';
        $geocode[97]='37.573339%2C55.687660';
        $geocode[53]='37.609308%2C55.752080';
        $geocode[105]='37.638737%2C55.807800';
        $geocode[135]='37.587344%2C55.898376';
        $geocode[156]='37.596812%2C55.583657';
        $geocode[5]='37.532870%2C55.800261';
        $geocode[109]='37.664581%2C55.869794';
        $geocode[57]='37.497863%2C55.743801';
        $geocode[71]='37.581280%2C55.760818';
        $geocode[47]='37.679035%2C55.772406';
        $geocode[69]='37.545474%2C55.773520';
        $geocode[7]='37.582107%2C55.777439';
        $geocode[]='37.582475%2C55.775515';
        $geocode[93]='37.526115%2C55.642357';
        $geocode[131]='37.603011%2C55.883868';
        $geocode[30]='37.610862%2C55.752627';
        $geocode[120]='37.609173%2C55.750504';
        $geocode[107]='37.637811%2C55.844597';
        $geocode[145]='37.750514%2C55.659460';
        $geocode[195]='37.515919%2C55.537964';
        $geocode[106]='37.641090%2C55.821401';
        $geocode[16]='37.619522%2C55.653294';
        $geocode[24]='37.505831%2C55.676910';
        $geocode[112]='37.590282%2C55.847922';
        $geocode[2]='37.486616%2C55.840209';
        $geocode[3]='37.497791%2C55.818923';
        $geocode[77]='37.687102%2C55.724900';
        $geocode[142]='37.754314%2C55.690446';
        $geocode[203]='37.382034%2C55.835508';
        $geocode[157]='37.559317%2C55.710438';
        $geocode[198]='37.543021%2C55.749547';
        $geocode[81]='37.817969%2C55.715682';
        $geocode[6]='37.558212%2C55.789704';
        $geocode[115]='37.580831%2C55.807881';
        $geocode[132]='37.622711%2C55.729012';
        $geocode[21]='37.717905%2C55.610697';
        $geocode[164]='37.577346%2C55.569667';
        $geocode[205]='37.614716%2C55.781484';
        $geocode[140]='37.676259%2C55.718070';
        $geocode[43]='37.781389%2C55.787746';
        $geocode[94]='37.540075%2C55.656682';
        $geocode[18]='37.656218%2C55.636107';
        $geocode[17]='37.598232%2C55.653177';
        $geocode[15]='37.649256%2C55.655432';
        $geocode[52]='37.565192%2C55.743416';
        $geocode[74]='37.631326%2C55.756498';
        $geocode[144]='37.685710%2C55.706320';
        $geocode[14]='37.663719%2C55.677423';
        $geocode[35]='37.656308%2C55.776153';
        $geocode[92]='37.520024%2C55.633658';
        $geocode[22]='37.746319%2C55.614073';
        $geocode[133]='37.577211%2C55.760211';
        $geocode[36]='37.666072%2C55.779849';
        $geocode[34]='37.648888%2C55.768795';
        $geocode[139]='37.664788%2C55.732464';
        $geocode[29]='37.603487%2C55.745068';
        $geocode[62]='37.408139%2C55.756842';
        $geocode[73]='37.624525%2C55.761502';
        $geocode[79]='37.765902%2C55.705417';
        $geocode[60]='37.445123%2C55.730634';
        $geocode[48]='37.659533%2C55.758580';
        $geocode[55]='37.534236%2C55.740178';
        $geocode[98]='37.586239%2C55.707689';
        $geocode[32]='37.627346%2C55.759162';
        $geocode[143]='37.762003%2C55.676265';
        $geocode[87]='37.656424%2C55.741171';
        $geocode[204]='37.616180%2C55.793723';
        $geocode[146]='37.744118%2C55.649368';
        $geocode[8]='37.596192%2C55.769808';
        $geocode[110]='37.661527%2C55.887473';
        $geocode[197]='37.533041%2C55.748640';
        $geocode[117]='37.598735%2C55.781788';
        $geocode[196]='37.361202%2C55.846108';
        $geocode[61]='37.416386%2C55.741004';
        $geocode[124]='37.622468%2C55.682991';
        $geocode[125]='37.610745%2C55.672854';
        $geocode[126]='37.605274%2C55.662379';
        $geocode[82]='37.817295%2C55.751675';
        $geocode[11]='37.629125%2C55.742276';
        $geocode[134]='37.601421%2C55.779565';
        $geocode[89]='37.553046%2C55.601655';
        $geocode[95]='37.554493%2C55.670077';
        $geocode[100]='37.612766%2C55.731257';
        $geocode[67]='37.493317%2C55.793581';
        $geocode[20]='37.695214%2C55.612690';
        $geocode[111]='37.604843%2C55.863384';
        $geocode[31]='37.615857%2C55.756558';
        $geocode[12]='37.639662%2C55.729736';
        $geocode[28]='37.592905%2C55.735150';
        $geocode[165]='37.516925%2C55.736164';
        $geocode[44]='37.749265%2C55.788424';
        $geocode[42]='37.799364%2C55.794376';
        $geocode[83]='37.786887%2C55.751320';
        $geocode[113]='37.575558%2C55.836524';
        $geocode[141]='37.728398%2C55.692972';
        $geocode[59]='37.467078%2C55.735986';
        $geocode[63]='37.436382%2C55.860529';
        $geocode[86]='37.680589%2C55.747024';
        $geocode[49]='37.620285%2C55.756361';
        $geocode[68]='37.517895%2C55.777201';
        $geocode[121]='37.618471%2C55.736807';
        $geocode[130]='37.603972%2C55.611577';
        $geocode[38]='37.715022%2C55.796167';
        $geocode[76]='37.666791%2C55.731602';
        $geocode[136]='37.633482%2C55.781757';
        $geocode[96]='37.562595%2C55.677671';
        $geocode[72]='37.604116%2C55.765362';
        $geocode[1]='37.476231%2C55.854891';
        $geocode[104]='37.636123%2C55.792513';
        $geocode[138]='37.681254%2C55.746228';
        $geocode[80]='37.793606%2C55.717366';
        $geocode[116]='37.587919%2C55.793981';
        $geocode[108]='37.653379%2C55.855558';
        $geocode[127]='37.598384%2C55.651552';
        $geocode[45]='37.719423%2C55.783195';
        $geocode[122]='37.625199%2C55.726680';
        $geocode[192]='37.554618%2C55.548034';
        $geocode[201]='37.472171%2C55.729828';
        $geocode[51]='37.583841%2C55.747642';
        $geocode[4]='37.514787%2C55.805042';
        $geocode[37]='37.679700%2C55.789198';
        $geocode[26]='37.562227%2C55.722761';
        $geocode[200]='37.403118%2C55.803691';
        $geocode[54]='37.548375%2C55.738784';
        $geocode[102]='37.632323%2C55.772315';
        $geocode[64]='37.439787%2C55.850510';
        $geocode[75]='37.653361%2C55.742397';
        $geocode[9]='37.605490%2C55.764668';
        $geocode[10]='37.618731%2C55.757506';
        $geocode[78]='37.732117%2C55.709211';
        $geocode[91]='37.505912%2C55.618730';
        $geocode[114]='37.578612%2C55.818948';
        $geocode[88]='37.626151%2C55.741156';
        $geocode[199]='37.621902%2C55.767939';
        $geocode[123]='37.622612%2C55.708841';
        $geocode[103]='37.637075%2C55.765422';
        $geocode[65]='37.437604%2C55.827080';
        $geocode[70]='37.561419%2C55.764273';
        $geocode[194]='37.531226%2C55.541825';
        $geocode[40]='37.735117%2C55.814264';
        $geocode[25]='37.534532%2C55.692440';
        $geocode[193]='37.542329%2C55.545207';
        $geocode[58]='37.483328%2C55.739519';
        $geocode[56]='37.514949%2C55.745970';
        $geocode[27]='37.580328%2C55.727232';
        $geocode[19]='37.669612%2C55.620982';
        $geocode[118]='37.620986%2C55.771616';
        $geocode[39]='37.744819%2C55.802988';
        $geocode[128]='37.606065%2C55.640538';
        $geocode[119]='37.608167%2C55.765843';
        $geocode[33]='37.638683%2C55.764794';
        $geocode[137]='37.659236%2C55.755940';
        $geocode[99]='37.607799%2C55.718821';
        $geocode[84]='37.751583%2C55.758255';
        $geocode[41]='37.798556%2C55.810228';
        $geocode[66]='37.463772%2C55.808827';
        $geocode[46]='37.705284%2C55.782066';
        $geocode[23]='37.482852%2C55.663146';
        $geocode[129]='37.609047%2C55.622436';
        $geocode[155]='37.600675%2C55.595883';
        $geocode[90]='37.533400%2C55.606182';
        $geocode[207]='37.743852%2C55.63332';
        $geocode[202]='37.384833%2C55.824026';
    
    return $geocode;
    
  }
   
    
    function cian_area(){
        $area["1"] = "Москва";
        $area["83"] = "населенный пункт в черте Москвы";
        $area["2"] = "Московская область";
        $area["10"] = "Санкт-Петербург";
        $area["11"] = "Ленинградская область";
        $area["3"] = "Владимирская область";
        $area["4"] = "Калужская область";
        $area["5"] = "Рязанская область";
        $area["9"] = "Смоленская область";
        $area["6"] = "Тверская область";
        $area["7"] = "Тульская область";
        $area["8"] = "Ярославская область";
        $area["12"] = "Амурская область";
        $area["13"] = "Архангельская область";
        $area["14"] = "Астраханская область";
        $area["15"] = "Белгородская область";
        $area["16"] = "Брянская область";
        $area["17"] = "Волгоградская область";
        $area["18"] = "Вологодская область";
        $area["19"] = "Воронежская область";
        $area["20"] = "Ивановская область";
        $area["21"] = "Иркутская область";
        $area["22"] = "Калининградская область";
        $area["23"] = "Кемеровская область";
        $area["24"] = "Кировская область";
        $area["25"] = "Костромская область";
        $area["26"] = "Курганская область";
        $area["27"] = "Курская область";
        $area["28"] = "Липецкая область";
        $area["29"] = "Магаданская область";
        $area["30"] = "Мурманская область";
        $area["31"] = "Нижегородская область";
        $area["32"] = "Новгородская область";
        $area["33"] = "Новосибирская область";
        $area["34"] = "Омская область";
        $area["35"] = "Оренбургская область";
        $area["36"] = "Орловская область";
        $area["37"] = "Пензенская область";
        $area["84"] = "Пермский край";
        $area["38"] = "Псковская область";
        $area["39"] = "Ростовская область";
        $area["40"] = "Самарская область";
        $area["41"] = "Саратовская область";
        $area["42"] = "Сахалинская область";
        $area["43"] = "Свердловская область";
        $area["44"] = "Тамбовская область";
        $area["45"] = "Томская область";
        $area["46"] = "Тюменская область";
        $area["47"] = "Ульяновская область";
        $area["48"] = "Челябинская область";
        $area["49"] = "Забайкальский край";
        $area["50"] = "республика Адыгея";
        $area["51"] = "республика Башкортостан";
        $area["52"] = "республика Бурятия";
        $area["53"] = "республика Алтай";
        $area["54"] = "республика Дагестан";
        $area["55"] = "республика Ингушская";
        $area["56"] = "республика Кабардино-Балкарская";
        $area["57"] = "республика Калмыкия";
        $area["58"] = "республика Карачаево-Черкесская";
        $area["59"] = "республика Карелия";
        $area["60"] = "республика Коми";
        $area["61"] = "республика Марий Эл";
        $area["62"] = "республика Мордовия";
        $area["63"] = "республика Саха";
        $area["64"] = "республика Северная Осетия-Алания";
        $area["65"] = "республика Татарстан";
        $area["66"] = "республика Тыва";
        $area["67"] = "республика Удмуртская";
        $area["68"] = "республика Хакасия";
        $area["69"] = "республика Чеченская";
        $area["70"] = "республика Чувашская";
        $area["71"] = "Алтайский край";
        $area["72"] = "Краснодарский край";
        $area["73"] = "Красноярский край";
        $area["74"] = "Приморский край";
        $area["75"] = "Ставропольский край";
        $area["76"] = "Хабаровский край";
        $area["77"] = "Еврейская автономная область";
        $area["78"] = "Ненецкий автономный округ";
        $area["82"] = "Ямало-Ненецкий автономный округ";
        $area["80"] = "Ханты-Мансийский автономный округ";
        $area["81"] = "Чукотский автономный округ";
        return $area;
    }
    
    
    function street_type(){
         $street[] = 'улица';
         $street[] = 'проспект';
         $street[] = 'шоссе';
         $street[] = 'проезд';
         $street[] = 'бульвар';
         $street[] = 'набережная';
         $street[] = 'переулок';
         $street[] = 'тупик';
         $street[] = 'аллея';
         $street[] = 'микрорайон';
         $street[] = 'площадь';
         $street[] = 'квартал';
         $street[] = 'линия';
         $street[] = 'просека';
         $street[] = 'платформа ';
        $street[] = 'деревня ';
        $street[] = 'поселок ';
        $street[] = 'село ';
        $street[] = 'хутор ';
         return $street;
    }
    
    function no_street(){
        $no_street[] = 'деревня ';
        $no_street[] = 'поселок ';
        $no_street[] = 'село ';
        $no_street[] = 'сельское поселение ';
        $no_street[] = 'хутор ';
        $no_street[] = 'платформа ';
        $no_street[] = ' Зеленоград,';
        
        return $no_street;
    }
    
      
  function action_types(){
    $action_types =array('0' => 'Не опеределено',
                         '1' => 'Зашёл на первую страничку системы',
                         '2' => 'Смотрел личные объекты',
                         '3' => 'Зашёл в меню добавления',
                         '4' => 'Зашёл в "Обновления"',
                         '5' => 'Смотрел личных клиентов',
                         '6' => 'Смотрел каталог объектов',
                         '7' => 'Проявил активность в общем чате',
                         '8' => 'Заполнил фильтр каталога объектов',
                         '9' => 'Просмотрел заявки в объектах',
                         '10' => 'Заполнил фильтр в заявках объектов',
                         '11' => 'Запросил контакты', //объекта
                         '12' => 'Зашёл в редактирование объекта',
                         '13' => 'Зашёл в добавление объекта Аренды',
                         '14' => 'Зашёл в добавление объекта Продажи',
                         '15' => 'Зашёл в добавление клиента Аренды',
                         '16' => 'Зашёл в добавление клиента Продажи',
                         '17' => 'Добавил объект Аренды',
                         '18' => 'Добавил объект Продажи',
                         '19' => 'Добавил клиента Аренды',
                         '20' => 'Добавил клиента Продажи',
                         '21' => 'Зашёл в добавление объекта',
                         '22' => 'Передал клиента',
                         '23' => 'Просмотрел объект по лоту',
                         '24' => 'Просмотрел стыковки объекта',
                         '25' => 'Просмотрел архив объектов',
                         '26' => 'Заархивировал объект',
                         '27' => 'Разархивировал объект',
                         '28' => 'Отредактировал пользователя',
                         '29' => 'Написал в чат клиента',
                         '30' => 'Проверил клиентов от сотрудника',
                         '31' => 'Отредактировал клиента',
                         '32' => 'Отредактировал объект',
                         '33' => 'Просмотрел клиента по лоту',
                         '34' => 'Просмотрел стыковки клиента',
                         '35' => 'Просмотрел заявки в клиентах',
                         '36' => 'Заполнил фильтр в клиентах объектов',
                         '37' => 'Зашёл в редактор объекта',
                         '38' => 'Зашёл в редактор клиента',
                         '39' => 'Сбросил фильтр в клиентах',
                         '40' => 'Зашёл в Контакты',
                         '41' => 'Зашёл в админку',
                         '42' => 'Зашёл в список пользователей',
                         '43' => 'Написал в чат объекта',
                         '44' => 'Зашёл в Резюме клиентов',
                         '45' => 'Настроил фильтр в Резюме клиентов',
                         '46' => 'Сброшен фильтр в объектах',
                         '47' => 'Просмотрел нового клиента',
                         '48' => 'Просмотрел стыковки нового клиента',
                         '49' => 'Просмотрел новый объект',
                         '50' => 'Просмотрел стыковки нового объекта',
                         '51' => 'Сброшен фильтр в клиентах',
                         '52' => 'Зашёл в Cообщения',
                         '53' => 'Сделал клиента личным',
                         '54' => 'Сделал объект личным',
                         '55' => 'Настроил фильтр в личных клиентах',
                         '56' => 'Зашёл в Сообщения',
                         '57' => 'Зашёл в Написать сообщение',
                         '58' => 'Отправил сообщение',
                         '59' => 'Заполнил фильтр в Каталоге объектов',
                         '60' => 'Заархивировал клиента',
                         '61' => 'Разархивировал клиента',
                         '62' => 'Передал объект',
                         '63' => 'Пользовался риелтопедией',
                         '64' => 'Перевёл объект в клиенты',
                         '65' => 'Перевёл клиента в объекты',
                         '66' => 'Пользовался Дополнительными сведениями',
                         '67' => 'Просматривал архив клиентов',
                         '68' => 'Просматривал Общегородскую базу',
                         '69' => 'Читал исходящие сообщения',
                         '70' => 'Зашёл в бухгалтерию (страница по умолчанию)',
                         '71' => 'Зашёл на страницу зарплат по пользователю в бухгалтерии',
                         '72' => 'Добавил запись в зарплату пользователя в бухгалтерии',
                         '73' => 'Добавил пользователя',
                         '74' => 'Настроил фильтр в пользователях',
                         '75' => 'Выставил права пользователю',
                         '76' => 'Заблокировал пользователя',
                         '77' => 'Настроил фильтры в архиве объектов',
                         '78' => 'Просмотрел личные объекты',
                         '79' => 'Просмотрел сделки бухгалтерии ',
                         '80' => 'Просмотрел сделки в бухгалтерии',
                         '81' => 'Написал личное сообщение в общий чат',
                         '82' => 'Добавил контакт',
                         '83' => 'Печать объекта',
                         '84' => 'Печать клиента',
                         '85' => 'Ввёл код для входа в бухгалтерию',
                         '86' => 'Добавил сделку в бухгалтерию',
                         '87' => 'Зашёл в типы зарплат бухгалтерии',
                         '88' => 'Зашёл в причины доходов бухгалтерии',
                         '89' => 'Зашёл в причины расходов бухгалтерии',
                         '90' => 'Изменил причины доходов бухгалтерии',
                         '91' => 'Изменил причины расходов бухгалтерии',
                         '92' => 'Изменил типы оплат бухгалтерии',
                         '93' => 'Изменил зарплату пользователю',
                         '94' => 'Просмотрел входящие сообщения',
                         '95' => 'Уволил пользователя',
                         '96' => 'Просмотрел отделы',
                         '97' => 'Изменил отделы',
                         '98' => 'Настроил фильтр архива клиентов',
                         '99' => 'Разблокировал пользователя',
                         '100' => 'Просмотр общей статистики бухгалтерии',
                         '101' => 'Настроил фильтры в общей статистике бухгалтерии',
                         '102' => 'Зашёл в форму добавления дохода пользователя',
                         '103' => 'Добавил доход пользователю в бухгалтерии',
                         '104' => 'Добавил счёт в бухгалтерию',
                         '105' => 'Отключение счёта',
                         '106' => 'Добавил счёт в сделку',
                         '107' => 'Закрыл сделку',
                         '108' => 'Работа с API',
                         '109' => 'Перевод пользователя в другой отдел',
                         '110' => 'Редактирование Контактов',
                         '111' => 'Зашёл в редактор пользователя',
                         '112' => 'Сбросил фильтр в общей таблице бухгалтерии',
                         '113' => 'Зашёл в админку автостыковок',
                         '114' => 'Изменил настройки автостыковок',
                         '115' => 'Просмотрел карточку объекта',
                         '116' => 'Проверил объекты от сотрудника',
                         '117' => 'Настроил фильтр в объектах от сотрудников',
                         '118' => 'Просмотрел карточку клиента',
                         '119' => 'Зашёл в системные сообщения',
                         '120' => 'Зашёл в списки',
                         '121' => 'Изменил списки',
                         '122' => 'Просмотрел карточку пользователя',
                         '123' => 'Удалил Контакт',
                         '124' => 'Подтвердил прохождение счёта',
                         '125' => 'Ввёл код удалённого доступа к системе',
                         '126' => 'Зашёл в форму добавления объекта',
                         '127' => 'Добавил объект',
                         '128' => 'Зашёл в таблицу Доступов',
                         '129' => 'Зашёл в меню добавления пользователя',
                         '130' => 'Зашёл в меню добавления сделки бухгалтерии',
                         '132' => 'Сбросил фильтр',
                         '133' => 'Отфильтровал в контактах',
                         '134' => 'Зашёл в редактирование прав пользователя',
                         '135' => 'Отредактировал права пользователя',
                         '136' => 'Зашёл в список должностей',
                         '137' => 'Статистика:Действия',
                         '138' => 'Статистика:Добавления',
                         '139' => 'Статистика:Статистика с досок',
                         '140' => 'Статистика:Отклонения АС',
                         '141' => 'Статистика:Причины отклонения',
                         '142' => 'Статистика:Другие',
                         '143' => 'Зашёл в голосовалку',
                         '144' => 'Проголосовал',
                        /* '145' => ' ',
                         '146' => ' ',
                         '147' => ' ',
                         '148' => ' ',
                         '149' => ' ',
                         '150' => ' ',*/
                         );
    
    return $action_types;
  }
  

 
 }
 ?>